app/views/events/index.html.erb

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <% @events.each do |event| %>
    <% place = Place.find_by(id: event.place) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<% begin %>
  <% user = User.find(session["warden.user.user.key"][0][0]) %>