app/views/tickets/_form.html.erb

SELECT "events".* FROM "events"
---
    <%= form.label :event_id, "Event: " %>
    <% @events=Event.all %>