app/views/tickets/index.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <% @tickets.each do |ticket| %>
    <% event = Event.find_by(id: ticket.event) %>