app/controllers/tickets_controller.rb

  def index
    @tickets = Ticket.all
---
SELECT "tickets".* FROM "tickets"

  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("description", "price", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Platea Baja"], ["price", 10000], ["event_id", 1], ["created_at", "2019-05-22 14:40:15.836266"], ["updated_at", "2019-05-22 14:40:15.836266"]]