app/controllers/user_tickets_controller.rb

  def index
    @user_tickets = UserTicket.where(user: User.find(session['warden.user.user.key'][0][0]) , paid: true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."user_id" = ? AND "user_tickets"."paid" = ?  [["user_id", 2], ["paid", "t"]]

  def new
    @current_user= User.find(session['warden.user.user.key'][0][0])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @user_ticket = UserTicket.new(user_ticket_params)

    respond_to do |format|
      if @user_ticket.save
---
INSERT INTO "user_tickets" ("user_id", "ticket_id", "time", "paid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["ticket_id", 2], ["time", "2019-05-23 14:48:04"], ["paid", "f"], ["created_at", "2019-05-23 14:48:22.030993"], ["updated_at", "2019-05-23 14:48:22.030993"]]

  def shopping
    @user_tickets = UserTicket.where(user: current_user, paid: false)
---
SELECT "user_tickets".* FROM "user_tickets" WHERE "user_tickets"."user_id" IS NULL AND "user_tickets"."paid" = ?  [["paid", "f"]]