app/views/user_tickets/_form.html.erb

    <%= form.label :ticket_id, "Ticket:" %>
    <% tickets=Ticket.all %>
---
SELECT "tickets".* FROM "tickets"

  </div>
  <% user = User.find(session["warden.user.user.key"][0][0]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]