app/views/user_tickets/index.html.erb

<% begin %>
  <% user = User.find(session["warden.user.user.key"][0][0]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]