app/views/user_tickets/shopping.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<% begin %>
  <% user = User.find(session["warden.user.user.key"][0][0]) %>